load-test/artillery.yml
config:
  target: "http://localhost:3000"
  socketio:
    transports: ["websocket"]
  phases:
    # Phase 1: Warm-up
    - duration: 30
      arrivalRate: 3
      name: "Warm-up (0-100 users)"
    
    # Phase 2: Ramp up
    - duration: 60
      arrivalRate: 7
      name: "Ramp-up (100-500 users)"
    
    # Phase 3: Spike test
    - duration: 30
      arrivalRate: 17
      name: "Spike (500-1000 users)"
    
    # Phase 4: Sustained load
    - duration: 120
      arrivalCount: 0
      maxVusers: 1000
      name: "Sustain (1000 users for 2 min)"
    
    # Phase 5: Cool down
    - duration: 30
      arrivalRate: 0
      name: "Cool down"

  processor: "./artillery-processor.js"
  
scenarios:
  - name: "WebSocket Connection and Price Updates"
    engine: socketio
    flow:
      # Connect to the server
      - emit:
          channel: "subscribe"
          data: ["BTC", "ETH", "SOL"]
      
      # Wait for initial price update
      - think: 1
      
      # Listen for price updates
      - loop:
        - emit:
            channel: "ping"
            data: "{{ $timestamp }}"
        - think: 2
        count: 30
      
      # Unsubscribe before disconnect
      - emit:
          channel: "unsubscribe"
          data: ["BTC", "ETH", "SOL"]
      
      - think: 1